XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/tzc_nsec_reg.h
/* 0x100 : tzc_bmx_tzmid */
#define TZC_NSEC_TZC_BMX_TZMID_OFFSET     (0x100)
#define TZC_NSEC_TZC_PICO_TZMID           TZC_NSEC_TZC_PICO_TZMID
#define TZC_NSEC_TZC_PICO_TZMID_POS       (0U)
#define TZC_NSEC_TZC_PICO_TZMID_LEN       (1U)
#define TZC_NSEC_TZC_PICO_TZMID_MSK       (((1U << TZC_NSEC_TZC_PICO_TZMID_LEN) - 1) << TZC_NSEC_TZC_PICO_TZMID_POS)
#define TZC_NSEC_TZC_PICO_TZMID_UMSK      (~(((1U << TZC_NSEC_TZC_PICO_TZMID_LEN) - 1) << TZC_NSEC_TZC_PICO_TZMID_POS))
#define TZC_NSEC_TZC_MM_TZMID             TZC_NSEC_TZC_MM_TZMID
#define TZC_NSEC_TZC_MM_TZMID_POS         (1U)
#define TZC_NSEC_TZC_MM_TZMID_LEN         (1U)
#define TZC_NSEC_TZC_MM_TZMID_MSK         (((1U << TZC_NSEC_TZC_MM_TZMID_LEN) - 1) << TZC_NSEC_TZC_MM_TZMID_POS)
#define TZC_NSEC_TZC_MM_TZMID_UMSK        (~(((1U << TZC_NSEC_TZC_MM_TZMID_LEN) - 1) << TZC_NSEC_TZC_MM_TZMID_POS))
#define TZC_NSEC_TZC_USB_TZMID            TZC_NSEC_TZC_USB_TZMID
#define TZC_NSEC_TZC_USB_TZMID_POS        (2U)
#define TZC_NSEC_TZC_USB_TZMID_LEN        (1U)
#define TZC_NSEC_TZC_USB_TZMID_MSK        (((1U << TZC_NSEC_TZC_USB_TZMID_LEN) - 1) << TZC_NSEC_TZC_USB_TZMID_POS)
#define TZC_NSEC_TZC_USB_TZMID_UMSK       (~(((1U << TZC_NSEC_TZC_USB_TZMID_LEN) - 1) << TZC_NSEC_TZC_USB_TZMID_POS))
#define TZC_NSEC_TZC_WIFI_TZMID           TZC_NSEC_TZC_WIFI_TZMID
#define TZC_NSEC_TZC_WIFI_TZMID_POS       (3U)
#define TZC_NSEC_TZC_WIFI_TZMID_LEN       (1U)
#define TZC_NSEC_TZC_WIFI_TZMID_MSK       (((1U << TZC_NSEC_TZC_WIFI_TZMID_LEN) - 1) << TZC_NSEC_TZC_WIFI_TZMID_POS)
#define TZC_NSEC_TZC_WIFI_TZMID_UMSK      (~(((1U << TZC_NSEC_TZC_WIFI_TZMID_LEN) - 1) << TZC_NSEC_TZC_WIFI_TZMID_POS))
#define TZC_NSEC_TZC_CCI_TZMID            TZC_NSEC_TZC_CCI_TZMID
#define TZC_NSEC_TZC_CCI_TZMID_POS        (4U)
#define TZC_NSEC_TZC_CCI_TZMID_LEN        (1U)
#define TZC_NSEC_TZC_CCI_TZMID_MSK        (((1U << TZC_NSEC_TZC_CCI_TZMID_LEN) - 1) << TZC_NSEC_TZC_CCI_TZMID_POS)
#define TZC_NSEC_TZC_CCI_TZMID_UMSK       (~(((1U << TZC_NSEC_TZC_CCI_TZMID_LEN) - 1) << TZC_NSEC_TZC_CCI_TZMID_POS))
#define TZC_NSEC_TZC_SDHM_TZMID           TZC_NSEC_TZC_SDHM_TZMID
#define TZC_NSEC_TZC_SDHM_TZMID_POS       (5U)
#define TZC_NSEC_TZC_SDHM_TZMID_LEN       (1U)
#define TZC_NSEC_TZC_SDHM_TZMID_MSK       (((1U << TZC_NSEC_TZC_SDHM_TZMID_LEN) - 1) << TZC_NSEC_TZC_SDHM_TZMID_POS)
#define TZC_NSEC_TZC_SDHM_TZMID_UMSK      (~(((1U << TZC_NSEC_TZC_SDHM_TZMID_LEN) - 1) << TZC_NSEC_TZC_SDHM_TZMID_POS))
#define TZC_NSEC_TZC_EMACA_TZMID          TZC_NSEC_TZC_EMACA_TZMID
#define TZC_NSEC_TZC_EMACA_TZMID_POS      (6U)
#define TZC_NSEC_TZC_EMACA_TZMID_LEN      (1U)
#define TZC_NSEC_TZC_EMACA_TZMID_MSK      (((1U << TZC_NSEC_TZC_EMACA_TZMID_LEN) - 1) << TZC_NSEC_TZC_EMACA_TZMID_POS)
#define TZC_NSEC_TZC_EMACA_TZMID_UMSK     (~(((1U << TZC_NSEC_TZC_EMACA_TZMID_LEN) - 1) << TZC_NSEC_TZC_EMACA_TZMID_POS))
#define TZC_NSEC_TZC_CPU_TZMID            TZC_NSEC_TZC_CPU_TZMID
#define TZC_NSEC_TZC_CPU_TZMID_POS        (7U)
#define TZC_NSEC_TZC_CPU_TZMID_LEN        (1U)
#define TZC_NSEC_TZC_CPU_TZMID_MSK        (((1U << TZC_NSEC_TZC_CPU_TZMID_LEN) - 1) << TZC_NSEC_TZC_CPU_TZMID_POS)
#define TZC_NSEC_TZC_CPU_TZMID_UMSK       (~(((1U << TZC_NSEC_TZC_CPU_TZMID_LEN) - 1) << TZC_NSEC_TZC_CPU_TZMID_POS))
#define TZC_NSEC_TZC_DMA_TZMID            TZC_NSEC_TZC_DMA_TZMID
#define TZC_NSEC_TZC_DMA_TZMID_POS        (8U)
#define TZC_NSEC_TZC_DMA_TZMID_LEN        (1U)
#define TZC_NSEC_TZC_DMA_TZMID_MSK        (((1U << TZC_NSEC_TZC_DMA_TZMID_LEN) - 1) << TZC_NSEC_TZC_DMA_TZMID_POS)
#define TZC_NSEC_TZC_DMA_TZMID_UMSK       (~(((1U << TZC_NSEC_TZC_DMA_TZMID_LEN) - 1) << TZC_NSEC_TZC_DMA_TZMID_POS))
#define TZC_NSEC_TZC_DMA2_TZMID           TZC_NSEC_TZC_DMA2_TZMID
#define TZC_NSEC_TZC_DMA2_TZMID_POS       (9U)
#define TZC_NSEC_TZC_DMA2_TZMID_LEN       (1U)
#define TZC_NSEC_TZC_DMA2_TZMID_MSK       (((1U << TZC_NSEC_TZC_DMA2_TZMID_LEN) - 1) << TZC_NSEC_TZC_DMA2_TZMID_POS)
#define TZC_NSEC_TZC_DMA2_TZMID_UMSK      (~(((1U << TZC_NSEC_TZC_DMA2_TZMID_LEN) - 1) << TZC_NSEC_TZC_DMA2_TZMID_POS))
#define TZC_NSEC_TZC_LZ4_TZMID            TZC_NSEC_TZC_LZ4_TZMID
#define TZC_NSEC_TZC_LZ4_TZMID_POS        (10U)
#define TZC_NSEC_TZC_LZ4_TZMID_LEN        (1U)
#define TZC_NSEC_TZC_LZ4_TZMID_MSK        (((1U << TZC_NSEC_TZC_LZ4_TZMID_LEN) - 1) << TZC_NSEC_TZC_LZ4_TZMID_POS)
#define TZC_NSEC_TZC_LZ4_TZMID_UMSK       (~(((1U << TZC_NSEC_TZC_LZ4_TZMID_LEN) - 1) << TZC_NSEC_TZC_LZ4_TZMID_POS))
#define TZC_NSEC_TZC_PICO_TZMID_SEL       TZC_NSEC_TZC_PICO_TZMID_SEL
#define TZC_NSEC_TZC_PICO_TZMID_SEL_POS   (16U)
#define TZC_NSEC_TZC_PICO_TZMID_SEL_LEN   (1U)
#define TZC_NSEC_TZC_PICO_TZMID_SEL_MSK   (((1U << TZC_NSEC_TZC_PICO_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_PICO_TZMID_SEL_POS)
#define TZC_NSEC_TZC_PICO_TZMID_SEL_UMSK  (~(((1U << TZC_NSEC_TZC_PICO_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_PICO_TZMID_SEL_POS))
#define TZC_NSEC_TZC_MM_TZMID_SEL         TZC_NSEC_TZC_MM_TZMID_SEL
#define TZC_NSEC_TZC_MM_TZMID_SEL_POS     (17U)
#define TZC_NSEC_TZC_MM_TZMID_SEL_LEN     (1U)
#define TZC_NSEC_TZC_MM_TZMID_SEL_MSK     (((1U << TZC_NSEC_TZC_MM_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_MM_TZMID_SEL_POS)
#define TZC_NSEC_TZC_MM_TZMID_SEL_UMSK    (~(((1U << TZC_NSEC_TZC_MM_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_MM_TZMID_SEL_POS))
#define TZC_NSEC_TZC_USB_TZMID_SEL        TZC_NSEC_TZC_USB_TZMID_SEL
#define TZC_NSEC_TZC_USB_TZMID_SEL_POS    (18U)
#define TZC_NSEC_TZC_USB_TZMID_SEL_LEN    (1U)
#define TZC_NSEC_TZC_USB_TZMID_SEL_MSK    (((1U << TZC_NSEC_TZC_USB_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_USB_TZMID_SEL_POS)
#define TZC_NSEC_TZC_USB_TZMID_SEL_UMSK   (~(((1U << TZC_NSEC_TZC_USB_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_USB_TZMID_SEL_POS))
#define TZC_NSEC_TZC_WIFI_TZMID_SEL       TZC_NSEC_TZC_WIFI_TZMID_SEL
#define TZC_NSEC_TZC_WIFI_TZMID_SEL_POS   (19U)
#define TZC_NSEC_TZC_WIFI_TZMID_SEL_LEN   (1U)
#define TZC_NSEC_TZC_WIFI_TZMID_SEL_MSK   (((1U << TZC_NSEC_TZC_WIFI_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_WIFI_TZMID_SEL_POS)
#define TZC_NSEC_TZC_WIFI_TZMID_SEL_UMSK  (~(((1U << TZC_NSEC_TZC_WIFI_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_WIFI_TZMID_SEL_POS))
#define TZC_NSEC_TZC_CCI_TZMID_SEL        TZC_NSEC_TZC_CCI_TZMID_SEL
#define TZC_NSEC_TZC_CCI_TZMID_SEL_POS    (20U)
#define TZC_NSEC_TZC_CCI_TZMID_SEL_LEN    (1U)
#define TZC_NSEC_TZC_CCI_TZMID_SEL_MSK    (((1U << TZC_NSEC_TZC_CCI_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_CCI_TZMID_SEL_POS)
#define TZC_NSEC_TZC_CCI_TZMID_SEL_UMSK   (~(((1U << TZC_NSEC_TZC_CCI_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_CCI_TZMID_SEL_POS))
#define TZC_NSEC_TZC_SDHM_TZMID_SEL       TZC_NSEC_TZC_SDHM_TZMID_SEL
#define TZC_NSEC_TZC_SDHM_TZMID_SEL_POS   (21U)
#define TZC_NSEC_TZC_SDHM_TZMID_SEL_LEN   (1U)
#define TZC_NSEC_TZC_SDHM_TZMID_SEL_MSK   (((1U << TZC_NSEC_TZC_SDHM_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_SDHM_TZMID_SEL_POS)
#define TZC_NSEC_TZC_SDHM_TZMID_SEL_UMSK  (~(((1U << TZC_NSEC_TZC_SDHM_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_SDHM_TZMID_SEL_POS))
#define TZC_NSEC_TZC_EMACA_TZMID_SEL      TZC_NSEC_TZC_EMACA_TZMID_SEL
#define TZC_NSEC_TZC_EMACA_TZMID_SEL_POS  (22U)
#define TZC_NSEC_TZC_EMACA_TZMID_SEL_LEN  (1U)
#define TZC_NSEC_TZC_EMACA_TZMID_SEL_MSK  (((1U << TZC_NSEC_TZC_EMACA_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_EMACA_TZMID_SEL_POS)
#define TZC_NSEC_TZC_EMACA_TZMID_SEL_UMSK (~(((1U << TZC_NSEC_TZC_EMACA_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_EMACA_TZMID_SEL_POS))
#define TZC_NSEC_TZC_CPU_TZMID_SEL        TZC_NSEC_TZC_CPU_TZMID_SEL
#define TZC_NSEC_TZC_CPU_TZMID_SEL_POS    (23U)
#define TZC_NSEC_TZC_CPU_TZMID_SEL_LEN    (1U)
#define TZC_NSEC_TZC_CPU_TZMID_SEL_MSK    (((1U << TZC_NSEC_TZC_CPU_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_CPU_TZMID_SEL_POS)
#define TZC_NSEC_TZC_CPU_TZMID_SEL_UMSK   (~(((1U << TZC_NSEC_TZC_CPU_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_CPU_TZMID_SEL_POS))
#define TZC_NSEC_TZC_DMA_TZMID_SEL        TZC_NSEC_TZC_DMA_TZMID_SEL
#define TZC_NSEC_TZC_DMA_TZMID_SEL_POS    (24U)
#define TZC_NSEC_TZC_DMA_TZMID_SEL_LEN    (1U)
#define TZC_NSEC_TZC_DMA_TZMID_SEL_MSK    (((1U << TZC_NSEC_TZC_DMA_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_DMA_TZMID_SEL_POS)
#define TZC_NSEC_TZC_DMA_TZMID_SEL_UMSK   (~(((1U << TZC_NSEC_TZC_DMA_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_DMA_TZMID_SEL_POS))
#define TZC_NSEC_TZC_DMA2_TZMID_SEL       TZC_NSEC_TZC_DMA2_TZMID_SEL
#define TZC_NSEC_TZC_DMA2_TZMID_SEL_POS   (25U)
#define TZC_NSEC_TZC_DMA2_TZMID_SEL_LEN   (1U)
#define TZC_NSEC_TZC_DMA2_TZMID_SEL_MSK   (((1U << TZC_NSEC_TZC_DMA2_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_DMA2_TZMID_SEL_POS)
#define TZC_NSEC_TZC_DMA2_TZMID_SEL_UMSK  (~(((1U << TZC_NSEC_TZC_DMA2_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_DMA2_TZMID_SEL_POS))
#define TZC_NSEC_TZC_LZ4_TZMID_SEL        TZC_NSEC_TZC_LZ4_TZMID_SEL
#define TZC_NSEC_TZC_LZ4_TZMID_SEL_POS    (26U)
#define TZC_NSEC_TZC_LZ4_TZMID_SEL_LEN    (1U)
#define TZC_NSEC_TZC_LZ4_TZMID_SEL_MSK    (((1U << TZC_NSEC_TZC_LZ4_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_LZ4_TZMID_SEL_POS)
#define TZC_NSEC_TZC_LZ4_TZMID_SEL_UMSK   (~(((1U << TZC_NSEC_TZC_LZ4_TZMID_SEL_LEN) - 1) << TZC_NSEC_TZC_LZ4_TZMID_SEL_POS))

/* 0x104 : tzc_bmx_tzmid_lock */
#define TZC_NSEC_TZC_BMX_TZMID_LOCK_OFFSET (0x104)
#define TZC_NSEC_TZC_PICO_TZMID_LOCK       TZC_NSEC_TZC_PICO_TZMID_LOCK
#define TZC_NSEC_TZC_PICO_TZMID_LOCK_POS   (0U)
#define TZC_NSEC_TZC_PICO_TZMID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_PICO_TZMID_LOCK_MSK   (((1U << TZC_NSEC_TZC_PICO_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_PICO_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_PICO_TZMID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_PICO_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_PICO_TZMID_LOCK_POS))
#define TZC_NSEC_TZC_MM_TZMID_LOCK         TZC_NSEC_TZC_MM_TZMID_LOCK
#define TZC_NSEC_TZC_MM_TZMID_LOCK_POS     (1U)
#define TZC_NSEC_TZC_MM_TZMID_LOCK_LEN     (1U)
#define TZC_NSEC_TZC_MM_TZMID_LOCK_MSK     (((1U << TZC_NSEC_TZC_MM_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_MM_TZMID_LOCK_UMSK    (~(((1U << TZC_NSEC_TZC_MM_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_TZMID_LOCK_POS))
#define TZC_NSEC_TZC_USB_TZMID_LOCK        TZC_NSEC_TZC_USB_TZMID_LOCK
#define TZC_NSEC_TZC_USB_TZMID_LOCK_POS    (2U)
#define TZC_NSEC_TZC_USB_TZMID_LOCK_LEN    (1U)
#define TZC_NSEC_TZC_USB_TZMID_LOCK_MSK    (((1U << TZC_NSEC_TZC_USB_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_USB_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_USB_TZMID_LOCK_UMSK   (~(((1U << TZC_NSEC_TZC_USB_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_USB_TZMID_LOCK_POS))
#define TZC_NSEC_TZC_WIFI_TZMID_LOCK       TZC_NSEC_TZC_WIFI_TZMID_LOCK
#define TZC_NSEC_TZC_WIFI_TZMID_LOCK_POS   (3U)
#define TZC_NSEC_TZC_WIFI_TZMID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_WIFI_TZMID_LOCK_MSK   (((1U << TZC_NSEC_TZC_WIFI_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_WIFI_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_WIFI_TZMID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_WIFI_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_WIFI_TZMID_LOCK_POS))
#define TZC_NSEC_TZC_CCI_TZMID_LOCK        TZC_NSEC_TZC_CCI_TZMID_LOCK
#define TZC_NSEC_TZC_CCI_TZMID_LOCK_POS    (4U)
#define TZC_NSEC_TZC_CCI_TZMID_LOCK_LEN    (1U)
#define TZC_NSEC_TZC_CCI_TZMID_LOCK_MSK    (((1U << TZC_NSEC_TZC_CCI_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CCI_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_CCI_TZMID_LOCK_UMSK   (~(((1U << TZC_NSEC_TZC_CCI_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CCI_TZMID_LOCK_POS))
#define TZC_NSEC_TZC_SDHM_TZMID_LOCK       TZC_NSEC_TZC_SDHM_TZMID_LOCK
#define TZC_NSEC_TZC_SDHM_TZMID_LOCK_POS   (5U)
#define TZC_NSEC_TZC_SDHM_TZMID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_SDHM_TZMID_LOCK_MSK   (((1U << TZC_NSEC_TZC_SDHM_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_SDHM_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_SDHM_TZMID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_SDHM_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_SDHM_TZMID_LOCK_POS))
#define TZC_NSEC_TZC_EMACA_TZMID_LOCK      TZC_NSEC_TZC_EMACA_TZMID_LOCK
#define TZC_NSEC_TZC_EMACA_TZMID_LOCK_POS  (6U)
#define TZC_NSEC_TZC_EMACA_TZMID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_EMACA_TZMID_LOCK_MSK  (((1U << TZC_NSEC_TZC_EMACA_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_EMACA_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_EMACA_TZMID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_EMACA_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_EMACA_TZMID_LOCK_POS))
#define TZC_NSEC_TZC_CPU_TZMID_LOCK        TZC_NSEC_TZC_CPU_TZMID_LOCK
#define TZC_NSEC_TZC_CPU_TZMID_LOCK_POS    (7U)
#define TZC_NSEC_TZC_CPU_TZMID_LOCK_LEN    (1U)
#define TZC_NSEC_TZC_CPU_TZMID_LOCK_MSK    (((1U << TZC_NSEC_TZC_CPU_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CPU_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_CPU_TZMID_LOCK_UMSK   (~(((1U << TZC_NSEC_TZC_CPU_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CPU_TZMID_LOCK_POS))
#define TZC_NSEC_TZC_DMA_TZMID_LOCK        TZC_NSEC_TZC_DMA_TZMID_LOCK
#define TZC_NSEC_TZC_DMA_TZMID_LOCK_POS    (8U)
#define TZC_NSEC_TZC_DMA_TZMID_LOCK_LEN    (1U)
#define TZC_NSEC_TZC_DMA_TZMID_LOCK_MSK    (((1U << TZC_NSEC_TZC_DMA_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_DMA_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_DMA_TZMID_LOCK_UMSK   (~(((1U << TZC_NSEC_TZC_DMA_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_DMA_TZMID_LOCK_POS))
#define TZC_NSEC_TZC_DMA2_TZMID_LOCK       TZC_NSEC_TZC_DMA2_TZMID_LOCK
#define TZC_NSEC_TZC_DMA2_TZMID_LOCK_POS   (9U)
#define TZC_NSEC_TZC_DMA2_TZMID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_DMA2_TZMID_LOCK_MSK   (((1U << TZC_NSEC_TZC_DMA2_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_DMA2_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_DMA2_TZMID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_DMA2_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_DMA2_TZMID_LOCK_POS))
#define TZC_NSEC_TZC_LZ4_TZMID_LOCK        TZC_NSEC_TZC_LZ4_TZMID_LOCK
#define TZC_NSEC_TZC_LZ4_TZMID_LOCK_POS    (10U)
#define TZC_NSEC_TZC_LZ4_TZMID_LOCK_LEN    (1U)
#define TZC_NSEC_TZC_LZ4_TZMID_LOCK_MSK    (((1U << TZC_NSEC_TZC_LZ4_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_LZ4_TZMID_LOCK_POS)
#define TZC_NSEC_TZC_LZ4_TZMID_LOCK_UMSK   (~(((1U << TZC_NSEC_TZC_LZ4_TZMID_LOCK_LEN) - 1) << TZC_NSEC_TZC_LZ4_TZMID_LOCK_POS))

/* 0x108 : tzc_bmx_s0 */
#define TZC_NSEC_TZC_BMX_S0_OFFSET            (0x108)
#define TZC_NSEC_TZC_BMX_MM_TZSID_EN          TZC_NSEC_TZC_BMX_MM_TZSID_EN
#define TZC_NSEC_TZC_BMX_MM_TZSID_EN_POS      (0U)
#define TZC_NSEC_TZC_BMX_MM_TZSID_EN_LEN      (2U)
#define TZC_NSEC_TZC_BMX_MM_TZSID_EN_MSK      (((1U << TZC_NSEC_TZC_BMX_MM_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_MM_TZSID_EN_POS)
#define TZC_NSEC_TZC_BMX_MM_TZSID_EN_UMSK     (~(((1U << TZC_NSEC_TZC_BMX_MM_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_MM_TZSID_EN_POS))
#define TZC_NSEC_TZC_BMX_DMA_TZSID_EN         TZC_NSEC_TZC_BMX_DMA_TZSID_EN
#define TZC_NSEC_TZC_BMX_DMA_TZSID_EN_POS     (2U)
#define TZC_NSEC_TZC_BMX_DMA_TZSID_EN_LEN     (2U)
#define TZC_NSEC_TZC_BMX_DMA_TZSID_EN_MSK     (((1U << TZC_NSEC_TZC_BMX_DMA_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_DMA_TZSID_EN_POS)
#define TZC_NSEC_TZC_BMX_DMA_TZSID_EN_UMSK    (~(((1U << TZC_NSEC_TZC_BMX_DMA_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_DMA_TZSID_EN_POS))
#define TZC_NSEC_TZC_BMX_DMA2_TZSID_EN        TZC_NSEC_TZC_BMX_DMA2_TZSID_EN
#define TZC_NSEC_TZC_BMX_DMA2_TZSID_EN_POS    (4U)
#define TZC_NSEC_TZC_BMX_DMA2_TZSID_EN_LEN    (2U)
#define TZC_NSEC_TZC_BMX_DMA2_TZSID_EN_MSK    (((1U << TZC_NSEC_TZC_BMX_DMA2_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_DMA2_TZSID_EN_POS)
#define TZC_NSEC_TZC_BMX_DMA2_TZSID_EN_UMSK   (~(((1U << TZC_NSEC_TZC_BMX_DMA2_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_DMA2_TZSID_EN_POS))
#define TZC_NSEC_TZC_BMX_PWR_TZSID_EN         TZC_NSEC_TZC_BMX_PWR_TZSID_EN
#define TZC_NSEC_TZC_BMX_PWR_TZSID_EN_POS     (6U)
#define TZC_NSEC_TZC_BMX_PWR_TZSID_EN_LEN     (2U)
#define TZC_NSEC_TZC_BMX_PWR_TZSID_EN_MSK     (((1U << TZC_NSEC_TZC_BMX_PWR_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_PWR_TZSID_EN_POS)
#define TZC_NSEC_TZC_BMX_PWR_TZSID_EN_UMSK    (~(((1U << TZC_NSEC_TZC_BMX_PWR_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_PWR_TZSID_EN_POS))
#define TZC_NSEC_TZC_BMX_SDH_TZSID_EN         TZC_NSEC_TZC_BMX_SDH_TZSID_EN
#define TZC_NSEC_TZC_BMX_SDH_TZSID_EN_POS     (8U)
#define TZC_NSEC_TZC_BMX_SDH_TZSID_EN_LEN     (2U)
#define TZC_NSEC_TZC_BMX_SDH_TZSID_EN_MSK     (((1U << TZC_NSEC_TZC_BMX_SDH_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_SDH_TZSID_EN_POS)
#define TZC_NSEC_TZC_BMX_SDH_TZSID_EN_UMSK    (~(((1U << TZC_NSEC_TZC_BMX_SDH_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_SDH_TZSID_EN_POS))
#define TZC_NSEC_TZC_BMX_EMAC_TZSID_EN        TZC_NSEC_TZC_BMX_EMAC_TZSID_EN
#define TZC_NSEC_TZC_BMX_EMAC_TZSID_EN_POS    (10U)
#define TZC_NSEC_TZC_BMX_EMAC_TZSID_EN_LEN    (2U)
#define TZC_NSEC_TZC_BMX_EMAC_TZSID_EN_MSK    (((1U << TZC_NSEC_TZC_BMX_EMAC_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_EMAC_TZSID_EN_POS)
#define TZC_NSEC_TZC_BMX_EMAC_TZSID_EN_UMSK   (~(((1U << TZC_NSEC_TZC_BMX_EMAC_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_BMX_EMAC_TZSID_EN_POS))
#define TZC_NSEC_TZC_BMX_MM_TZSID_LOCK        TZC_NSEC_TZC_BMX_MM_TZSID_LOCK
#define TZC_NSEC_TZC_BMX_MM_TZSID_LOCK_POS    (16U)
#define TZC_NSEC_TZC_BMX_MM_TZSID_LOCK_LEN    (1U)
#define TZC_NSEC_TZC_BMX_MM_TZSID_LOCK_MSK    (((1U << TZC_NSEC_TZC_BMX_MM_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_MM_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_BMX_MM_TZSID_LOCK_UMSK   (~(((1U << TZC_NSEC_TZC_BMX_MM_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_MM_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_BMX_DMA_TZSID_LOCK       TZC_NSEC_TZC_BMX_DMA_TZSID_LOCK
#define TZC_NSEC_TZC_BMX_DMA_TZSID_LOCK_POS   (17U)
#define TZC_NSEC_TZC_BMX_DMA_TZSID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_BMX_DMA_TZSID_LOCK_MSK   (((1U << TZC_NSEC_TZC_BMX_DMA_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_DMA_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_BMX_DMA_TZSID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_BMX_DMA_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_DMA_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_BMX_DMA2_TZSID_LOCK      TZC_NSEC_TZC_BMX_DMA2_TZSID_LOCK
#define TZC_NSEC_TZC_BMX_DMA2_TZSID_LOCK_POS  (18U)
#define TZC_NSEC_TZC_BMX_DMA2_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_BMX_DMA2_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_BMX_DMA2_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_DMA2_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_BMX_DMA2_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_BMX_DMA2_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_DMA2_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_BMX_PWR_TZSID_LOCK       TZC_NSEC_TZC_BMX_PWR_TZSID_LOCK
#define TZC_NSEC_TZC_BMX_PWR_TZSID_LOCK_POS   (19U)
#define TZC_NSEC_TZC_BMX_PWR_TZSID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_BMX_PWR_TZSID_LOCK_MSK   (((1U << TZC_NSEC_TZC_BMX_PWR_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_PWR_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_BMX_PWR_TZSID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_BMX_PWR_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_PWR_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_BMX_SDH_TZSID_LOCK       TZC_NSEC_TZC_BMX_SDH_TZSID_LOCK
#define TZC_NSEC_TZC_BMX_SDH_TZSID_LOCK_POS   (20U)
#define TZC_NSEC_TZC_BMX_SDH_TZSID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_BMX_SDH_TZSID_LOCK_MSK   (((1U << TZC_NSEC_TZC_BMX_SDH_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_SDH_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_BMX_SDH_TZSID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_BMX_SDH_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_SDH_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_BMX_EMAC_TZSID_LOCK      TZC_NSEC_TZC_BMX_EMAC_TZSID_LOCK
#define TZC_NSEC_TZC_BMX_EMAC_TZSID_LOCK_POS  (21U)
#define TZC_NSEC_TZC_BMX_EMAC_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_BMX_EMAC_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_BMX_EMAC_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_EMAC_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_BMX_EMAC_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_BMX_EMAC_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_BMX_EMAC_TZSID_LOCK_POS))

