XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/tzc_nsec_reg.h
/* 0x310 : tzc_mm_bmx_s2 */
#define TZC_NSEC_TZC_MM_BMX_S2_OFFSET        (0x310)
#define TZC_NSEC_TZC_CODEC_S10_TZSID_EN      TZC_NSEC_TZC_CODEC_S10_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S10_TZSID_EN_POS  (0U)
#define TZC_NSEC_TZC_CODEC_S10_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S10_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S10_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S10_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S10_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S10_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S10_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S11_TZSID_EN      TZC_NSEC_TZC_CODEC_S11_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S11_TZSID_EN_POS  (2U)
#define TZC_NSEC_TZC_CODEC_S11_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S11_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S11_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S11_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S11_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S11_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S11_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S12_TZSID_EN      TZC_NSEC_TZC_CODEC_S12_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S12_TZSID_EN_POS  (4U)
#define TZC_NSEC_TZC_CODEC_S12_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S12_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S12_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S12_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S12_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S12_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S12_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S13_TZSID_EN      TZC_NSEC_TZC_CODEC_S13_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S13_TZSID_EN_POS  (6U)
#define TZC_NSEC_TZC_CODEC_S13_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S13_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S13_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S13_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S13_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S13_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S13_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S14_TZSID_EN      TZC_NSEC_TZC_CODEC_S14_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S14_TZSID_EN_POS  (8U)
#define TZC_NSEC_TZC_CODEC_S14_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S14_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S14_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S14_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S14_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S14_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S14_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S15_TZSID_EN      TZC_NSEC_TZC_CODEC_S15_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S15_TZSID_EN_POS  (10U)
#define TZC_NSEC_TZC_CODEC_S15_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S15_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S15_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S15_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S15_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S15_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S15_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S16_TZSID_EN      TZC_NSEC_TZC_CODEC_S16_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S16_TZSID_EN_POS  (12U)
#define TZC_NSEC_TZC_CODEC_S16_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S16_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S16_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S16_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S16_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S16_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S16_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S17_TZSID_EN      TZC_NSEC_TZC_CODEC_S17_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S17_TZSID_EN_POS  (14U)
#define TZC_NSEC_TZC_CODEC_S17_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S17_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S17_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S17_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S17_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S17_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S17_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S18_TZSID_EN      TZC_NSEC_TZC_CODEC_S18_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S18_TZSID_EN_POS  (16U)
#define TZC_NSEC_TZC_CODEC_S18_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S18_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S18_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S18_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S18_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S18_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S18_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S19_TZSID_EN      TZC_NSEC_TZC_CODEC_S19_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S19_TZSID_EN_POS  (18U)
#define TZC_NSEC_TZC_CODEC_S19_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S19_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S19_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S19_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S19_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S19_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S19_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S1A_TZSID_EN      TZC_NSEC_TZC_CODEC_S1A_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S1A_TZSID_EN_POS  (20U)
#define TZC_NSEC_TZC_CODEC_S1A_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S1A_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1A_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1A_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S1A_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1A_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1A_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S1B_TZSID_EN      TZC_NSEC_TZC_CODEC_S1B_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S1B_TZSID_EN_POS  (22U)
#define TZC_NSEC_TZC_CODEC_S1B_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S1B_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1B_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1B_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S1B_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1B_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1B_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S1C_TZSID_EN      TZC_NSEC_TZC_CODEC_S1C_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S1C_TZSID_EN_POS  (24U)
#define TZC_NSEC_TZC_CODEC_S1C_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S1C_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1C_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1C_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S1C_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1C_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1C_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S1D_TZSID_EN      TZC_NSEC_TZC_CODEC_S1D_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S1D_TZSID_EN_POS  (26U)
#define TZC_NSEC_TZC_CODEC_S1D_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S1D_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1D_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1D_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S1D_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1D_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1D_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S1E_TZSID_EN      TZC_NSEC_TZC_CODEC_S1E_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S1E_TZSID_EN_POS  (28U)
#define TZC_NSEC_TZC_CODEC_S1E_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S1E_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1E_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1E_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S1E_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1E_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1E_TZSID_EN_POS))
#define TZC_NSEC_TZC_CODEC_S1F_TZSID_EN      TZC_NSEC_TZC_CODEC_S1F_TZSID_EN
#define TZC_NSEC_TZC_CODEC_S1F_TZSID_EN_POS  (30U)
#define TZC_NSEC_TZC_CODEC_S1F_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_CODEC_S1F_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1F_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1F_TZSID_EN_POS)
#define TZC_NSEC_TZC_CODEC_S1F_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1F_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1F_TZSID_EN_POS))

/* 0x314 : tzc_mm_bmx_s_lock0 */
#define TZC_NSEC_TZC_MM_BMX_S_LOCK0_OFFSET      (0x314)
#define TZC_NSEC_TZC_MMPERI_S10_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S10_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S10_TZSID_LOCK_POS  (0U)
#define TZC_NSEC_TZC_MMPERI_S10_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S10_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S10_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S10_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S10_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S10_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S10_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S11_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S11_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S11_TZSID_LOCK_POS  (1U)
#define TZC_NSEC_TZC_MMPERI_S11_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S11_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S11_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S11_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S11_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S11_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S11_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S12_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S12_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S12_TZSID_LOCK_POS  (2U)
#define TZC_NSEC_TZC_MMPERI_S12_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S12_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S12_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S12_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S12_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S12_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S12_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S13_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S13_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S13_TZSID_LOCK_POS  (3U)
#define TZC_NSEC_TZC_MMPERI_S13_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S13_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S13_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S13_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S13_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S13_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S13_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S14_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S14_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S14_TZSID_LOCK_POS  (4U)
#define TZC_NSEC_TZC_MMPERI_S14_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S14_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S14_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S14_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S14_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S14_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S14_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S15_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S15_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S15_TZSID_LOCK_POS  (5U)
#define TZC_NSEC_TZC_MMPERI_S15_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S15_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S15_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S15_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S15_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S15_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S15_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S16_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S16_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S16_TZSID_LOCK_POS  (6U)
#define TZC_NSEC_TZC_MMPERI_S16_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S16_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S16_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S16_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S16_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S16_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S16_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S17_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S17_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S17_TZSID_LOCK_POS  (7U)
#define TZC_NSEC_TZC_MMPERI_S17_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S17_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S17_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S17_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S17_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S17_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S17_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S18_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S18_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S18_TZSID_LOCK_POS  (8U)
#define TZC_NSEC_TZC_MMPERI_S18_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S18_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S18_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S18_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S18_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S18_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S18_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S19_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S19_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S19_TZSID_LOCK_POS  (9U)
#define TZC_NSEC_TZC_MMPERI_S19_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S19_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S19_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S19_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S19_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S19_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S19_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S1A_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S1A_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S1A_TZSID_LOCK_POS  (10U)
#define TZC_NSEC_TZC_MMPERI_S1A_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S1A_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S1A_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1A_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S1A_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S1A_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1A_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S1B_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S1B_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S1B_TZSID_LOCK_POS  (11U)
#define TZC_NSEC_TZC_MMPERI_S1B_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S1B_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S1B_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1B_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S1B_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S1B_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1B_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S1C_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S1C_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S1C_TZSID_LOCK_POS  (12U)
#define TZC_NSEC_TZC_MMPERI_S1C_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S1C_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S1C_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1C_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S1C_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S1C_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1C_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S1D_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S1D_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S1D_TZSID_LOCK_POS  (13U)
#define TZC_NSEC_TZC_MMPERI_S1D_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S1D_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S1D_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1D_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S1D_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S1D_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1D_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S1E_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S1E_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S1E_TZSID_LOCK_POS  (14U)
#define TZC_NSEC_TZC_MMPERI_S1E_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S1E_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S1E_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1E_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S1E_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S1E_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1E_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MMPERI_S1F_TZSID_LOCK      TZC_NSEC_TZC_MMPERI_S1F_TZSID_LOCK
#define TZC_NSEC_TZC_MMPERI_S1F_TZSID_LOCK_POS  (15U)
#define TZC_NSEC_TZC_MMPERI_S1F_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MMPERI_S1F_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MMPERI_S1F_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1F_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MMPERI_S1F_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MMPERI_S1F_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MMPERI_S1F_TZSID_LOCK_POS))

