XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/tzc_nsec_reg.h
/* 0x38C : tzc_psrama_tzsrg_r1 */
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_OFFSET     (0x38C)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_END        TZC_NSEC_TZC_PSRAMA_TZSRG_R1_END
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_END_POS    (0U)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_END_LEN    (16U)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_END_MSK    (((1U << TZC_NSEC_TZC_PSRAMA_TZSRG_R1_END_LEN) - 1) << TZC_NSEC_TZC_PSRAMA_TZSRG_R1_END_POS)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_END_UMSK   (~(((1U << TZC_NSEC_TZC_PSRAMA_TZSRG_R1_END_LEN) - 1) << TZC_NSEC_TZC_PSRAMA_TZSRG_R1_END_POS))
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_START      TZC_NSEC_TZC_PSRAMA_TZSRG_R1_START
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_START_POS  (16U)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_START_LEN  (16U)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_START_MSK  (((1U << TZC_NSEC_TZC_PSRAMA_TZSRG_R1_START_LEN) - 1) << TZC_NSEC_TZC_PSRAMA_TZSRG_R1_START_POS)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R1_START_UMSK (~(((1U << TZC_NSEC_TZC_PSRAMA_TZSRG_R1_START_LEN) - 1) << TZC_NSEC_TZC_PSRAMA_TZSRG_R1_START_POS))

/* 0x390 : tzc_psrama_tzsrg_r2 */
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_OFFSET     (0x390)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_END        TZC_NSEC_TZC_PSRAMA_TZSRG_R2_END
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_END_POS    (0U)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_END_LEN    (16U)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_END_MSK    (((1U << TZC_NSEC_TZC_PSRAMA_TZSRG_R2_END_LEN) - 1) << TZC_NSEC_TZC_PSRAMA_TZSRG_R2_END_POS)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_END_UMSK   (~(((1U << TZC_NSEC_TZC_PSRAMA_TZSRG_R2_END_LEN) - 1) << TZC_NSEC_TZC_PSRAMA_TZSRG_R2_END_POS))
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_START      TZC_NSEC_TZC_PSRAMA_TZSRG_R2_START
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_START_POS  (16U)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_START_LEN  (16U)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_START_MSK  (((1U << TZC_NSEC_TZC_PSRAMA_TZSRG_R2_START_LEN) - 1) << TZC_NSEC_TZC_PSRAMA_TZSRG_R2_START_POS)
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R2_START_UMSK (~(((1U << TZC_NSEC_TZC_PSRAMA_TZSRG_R2_START_LEN) - 1) << TZC_NSEC_TZC_PSRAMA_TZSRG_R2_START_POS))

/* 0x394 : tzc_psrama_tzsrg_r3 */
#define TZC_NSEC_TZC_PSRAMA_TZSRG_R3_OFFSET (0x394)

/* 0x3a0 : tzc_psramb_tzsrg_ctrl */
#define TZC_NSEC_TZC_PSRAMB_TZSRG_CTRL_OFFSET   (0x3a0)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_ID_EN      TZC_NSEC_TZC_PSRAMB_TZSRG_R0_ID_EN
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_ID_EN_POS  (0U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_ID_EN_LEN  (2U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_ID_EN_MSK  (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_ID_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_ID_EN_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_ID_EN_UMSK (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_ID_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_ID_EN_POS))
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_ID_EN      TZC_NSEC_TZC_PSRAMB_TZSRG_R1_ID_EN
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_ID_EN_POS  (2U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_ID_EN_LEN  (2U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_ID_EN_MSK  (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_ID_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_ID_EN_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_ID_EN_UMSK (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_ID_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_ID_EN_POS))
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_ID_EN      TZC_NSEC_TZC_PSRAMB_TZSRG_R2_ID_EN
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_ID_EN_POS  (4U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_ID_EN_LEN  (2U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_ID_EN_MSK  (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_ID_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_ID_EN_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_ID_EN_UMSK (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_ID_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_ID_EN_POS))
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_EN         TZC_NSEC_TZC_PSRAMB_TZSRG_R0_EN
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_EN_POS     (16U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_EN_LEN     (1U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_EN_MSK     (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_EN_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_EN_UMSK    (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_EN_POS))
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_EN         TZC_NSEC_TZC_PSRAMB_TZSRG_R1_EN
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_EN_POS     (17U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_EN_LEN     (1U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_EN_MSK     (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_EN_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_EN_UMSK    (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_EN_POS))
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_EN         TZC_NSEC_TZC_PSRAMB_TZSRG_R2_EN
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_EN_POS     (18U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_EN_LEN     (1U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_EN_MSK     (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_EN_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_EN_UMSK    (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_EN_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_EN_POS))
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_LOCK       TZC_NSEC_TZC_PSRAMB_TZSRG_R0_LOCK
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_LOCK_POS   (24U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_LOCK_MSK   (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_LOCK_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_LOCK_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R0_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_LOCK_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R0_LOCK_POS))
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_LOCK       TZC_NSEC_TZC_PSRAMB_TZSRG_R1_LOCK
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_LOCK_POS   (25U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_LOCK_MSK   (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_LOCK_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_LOCK_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R1_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_LOCK_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R1_LOCK_POS))
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_LOCK       TZC_NSEC_TZC_PSRAMB_TZSRG_R2_LOCK
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_LOCK_POS   (26U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_LOCK_MSK   (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_LOCK_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_LOCK_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_R2_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_LOCK_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_R2_LOCK_POS))

/* 0x3A4 : tzc_psramb_tzsrg_adr_mask */
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_OFFSET    (0x3A4)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK           TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_POS       (0U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LEN       (16U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_MSK       (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_UMSK      (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_POS))
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LOCK      TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LOCK
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LOCK_POS  (16U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LOCK_MSK  (((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LOCK_POS)
#define TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_NSEC_TZC_PSRAMB_TZSRG_ADR_MASK_LOCK_POS))

