XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/tzc_nsec_reg.h
    /* 0x38C : tzc_psrama_tzsrg_r1 */
    union {
        struct {
            uint32_t tzc_psrama_tzsrg_r1_end   : 16; /* [15: 0],          r,     0xffff */
            uint32_t tzc_psrama_tzsrg_r1_start : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psrama_tzsrg_r1;

    /* 0x390 : tzc_psrama_tzsrg_r2 */
    union {
        struct {
            uint32_t tzc_psrama_tzsrg_r2_end   : 16; /* [15: 0],          r,     0xffff */
            uint32_t tzc_psrama_tzsrg_r2_start : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psrama_tzsrg_r2;

    /* 0x394 : tzc_psrama_tzsrg_r3 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psrama_tzsrg_r3;

    /* 0x398  reserved */
    uint8_t RESERVED0x398[8];

    /* 0x3a0 : tzc_psramb_tzsrg_ctrl */
    union {
        struct {
            uint32_t tzc_psramb_tzsrg_r0_id_en : 2;  /* [ 1: 0],          r,        0x3 */
            uint32_t tzc_psramb_tzsrg_r1_id_en : 2;  /* [ 3: 2],          r,        0x3 */
            uint32_t tzc_psramb_tzsrg_r2_id_en : 2;  /* [ 5: 4],          r,        0x3 */
            uint32_t reserved_6_15             : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t tzc_psramb_tzsrg_r0_en    : 1;  /* [   16],          r,        0x0 */
            uint32_t tzc_psramb_tzsrg_r1_en    : 1;  /* [   17],          r,        0x0 */
            uint32_t tzc_psramb_tzsrg_r2_en    : 1;  /* [   18],          r,        0x0 */
            uint32_t reserved_19_23            : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t tzc_psramb_tzsrg_r0_lock  : 1;  /* [   24],          r,        0x0 */
            uint32_t tzc_psramb_tzsrg_r1_lock  : 1;  /* [   25],          r,        0x0 */
            uint32_t tzc_psramb_tzsrg_r2_lock  : 1;  /* [   26],          r,        0x0 */
            uint32_t reserved_27_31            : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psramb_tzsrg_ctrl;

    /* 0x3A4 : tzc_psramb_tzsrg_adr_mask */
    union {
        struct {
            uint32_t tzc_psramb_tzsrg_adr_mask      : 16; /* [15: 0],          r,        0x0 */
            uint32_t tzc_psramb_tzsrg_adr_mask_lock : 1;  /* [   16],          r,        0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psramb_tzsrg_adr_mask;

    /* 0x3A8 : tzc_psramb_tzsrg_r0 */
    union {
        struct {
            uint32_t tzc_psramb_tzsrg_r0_end   : 16; /* [15: 0],          r,     0xffff */
            uint32_t tzc_psramb_tzsrg_r0_start : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psramb_tzsrg_r0;

    /* 0x3AC : tzc_psramb_tzsrg_r1 */
    union {
        struct {
            uint32_t tzc_psramb_tzsrg_r1_end   : 16; /* [15: 0],          r,     0xffff */
            uint32_t tzc_psramb_tzsrg_r1_start : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psramb_tzsrg_r1;

    /* 0x3B0 : tzc_psramb_tzsrg_r2 */
    union {
        struct {
            uint32_t tzc_psramb_tzsrg_r2_end   : 16; /* [15: 0],          r,     0xffff */
            uint32_t tzc_psramb_tzsrg_r2_start : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psramb_tzsrg_r2;

    /* 0x3B4 : tzc_psramb_tzsrg_r3 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psramb_tzsrg_r3;

    /* 0x3b8  reserved */
    uint8_t RESERVED0x3b8[8];

    /* 0x3c0 : tzc_xram_tzsrg_ctrl */
    union {
        struct {
            uint32_t tzc_xram_tzsrg_r0_id_en : 2;  /* [ 1: 0],          r,        0x3 */
            uint32_t tzc_xram_tzsrg_r1_id_en : 2;  /* [ 3: 2],          r,        0x3 */
            uint32_t tzc_xram_tzsrg_r2_id_en : 2;  /* [ 5: 4],          r,        0x3 */
            uint32_t reserved_6_15           : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t tzc_xram_tzsrg_r0_en    : 1;  /* [   16],          r,        0x0 */
            uint32_t tzc_xram_tzsrg_r1_en    : 1;  /* [   17],          r,        0x0 */
            uint32_t tzc_xram_tzsrg_r2_en    : 1;  /* [   18],          r,        0x0 */
            uint32_t reserved_19_23          : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t tzc_xram_tzsrg_r0_lock  : 1;  /* [   24],          r,        0x0 */
            uint32_t tzc_xram_tzsrg_r1_lock  : 1;  /* [   25],          r,        0x0 */
            uint32_t tzc_xram_tzsrg_r2_lock  : 1;  /* [   26],          r,        0x0 */
            uint32_t reserved_27_31          : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_xram_tzsrg_ctrl;

    /* 0x3C4 : tzc_xram_tzsrg_adr_mask */
    union {
        struct {
            uint32_t tzc_xram_tzsrg_adr_mask      : 10; /* [ 9: 0],          r,        0x0 */
            uint32_t reserved_10_15               : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_xram_tzsrg_adr_mask_lock : 1;  /* [   16],          r,        0x0 */
            uint32_t reserved_17_31               : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_xram_tzsrg_adr_mask;

    /* 0x3C8 : tzc_xram_tzsrg_r0 */
    union {
        struct {
            uint32_t tzc_xram_tzsrg_r0_end   : 10; /* [ 9: 0],          r,      0x3ff */
            uint32_t reserved_10_15          : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_xram_tzsrg_r0_start : 10; /* [25:16],          r,        0x0 */
            uint32_t reserved_26_31          : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_xram_tzsrg_r0;

    /* 0x3CC : tzc_xram_tzsrg_r1 */
    union {
        struct {
            uint32_t tzc_xram_tzsrg_r1_end   : 10; /* [ 9: 0],          r,      0x3ff */
            uint32_t reserved_10_15          : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_xram_tzsrg_r1_start : 10; /* [25:16],          r,        0x0 */
            uint32_t reserved_26_31          : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_xram_tzsrg_r1;

    /* 0x3D0 : tzc_xram_tzsrg_r2 */
    union {
        struct {
            uint32_t tzc_xram_tzsrg_r2_end   : 10; /* [ 9: 0],          r,      0x3ff */
            uint32_t reserved_10_15          : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_xram_tzsrg_r2_start : 10; /* [25:16],          r,        0x0 */
            uint32_t reserved_26_31          : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_xram_tzsrg_r2;

